package java_exam6;

public class exam7 {
	  public static void main(String[] args) {
		    introduce(3);

		    // 안녕하세요. 20살 홍길동입니다.!
		    // 안녕하세요. 20살 홍길동입니다.!
		    // 안녕하세요. 20살 홍길동입니다.!

		    introduce(5);
		    // 안녕하세요. 20살 홍길동입니다.!
		    // 안녕하세요. 20살 홍길동입니다.!
		    // 안녕하세요. 20살 홍길동입니다.!
		    // 안녕하세요. 20살 홍길동입니다.!
		    // 안녕하세요. 20살 홍길동입니다.!

		    introduce(10);
		    // 안녕하세요. 20살 홍길동입니다.!
		    // 안녕하세요. 20살 홍길동입니다.!
		    // 안녕하세요. 20살 홍길동입니다.!
		    // 안녕하세요. 20살 홍길동입니다.!
		    // 안녕하세요. 20살 홍길동입니다.!
		    // 안녕하세요. 20살 홍길동입니다.!
		    // 안녕하세요. 20살 홍길동입니다.!
		    // 안녕하세요. 20살 홍길동입니다.!
		    // 안녕하세요. 20살 홍길동입니다.!
		    // 안녕하세요. 20살 홍길동입니다.!
		  }
	  public static void introduce(int num) {
		  for(num = 0; num < 11; num++) {
		  if (num == 3) {
			  System.out.println("안녕하세요. 20살 홍길동입니다.!"); 
		  } else if (num == 5) {
			  System.out.println("안녕하세요. 20살 홍길동입니다.!");
		  } else if (num == 10) {
			  System.out.println("안녕하세요. 20살 홍길동입니다.!");
		  }
		 }
	  }
}
