package java_exam19;
//철수, 영희, 길동, 짱구 네 학생이 있습니다.
//학생들은 국어, 수학, 영어 성적을 갖습니다.
//철수는 국어 90, 수학 76, 영어 82
//영희는 국어 77, 수학 94, 영어 85
//길동은 국어 96, 수학 100, 영어 100
//짱구는 국어 52, 수학 8, 영어 0
//각 학생들의 성적을 HashMap으로 만들어 관리해주세요.
//HashMap을 ArrayList에 저장하여 관리해주세요.
public class exam5 {

  public static void main(String[] args) {
    
    // 1. HashMap을 이용해 각각의 학생 정보를 저장해주세요.


    // 2. HashMap에 저장되어 있는 철수의 성적 정보를 출력해주세요.
    // 출력:
    // 이름 : 철수 - 국어 90, 수학 76, 영어 82


    // 3. 모든 학생들의 성적 정보를 ArrayList에 저장해주세요.


    // 4. ArrayList를 이용해 모든 학생들의 성적 정보를 출력해주세요.
    // 출력:
    // 이름 : 철수 - 국어 90, 수학 76, 영어 82
    // 이름 : 영희 - 국어 77, 수학 94, 영어 85
    // 이름 : 길동 - 국어 96, 수학 100, 영어 100
    // 이름 : 짱구 - 국어 52, 수학 8, 영어 0

  }
}
